---
type: MEPAnalyticalConnectionType
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# MEPAnalyticalConnectionType

`Autodesk.Revit.DB.MEPAnalyticalConnectionType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2018 | `public static MEPAnalyticalConnectionType Create ( Document doc , string name )` |
| Method | FindTypeByName | 2018 | `public static ElementId FindTypeByName ( Document doc , string name )` |
| Method | IsNameUnused | 2018 | `public static bool IsNameUnused ( Document doc , string name )` |
| Property | Parameter | — | `` |
| Property | PressureLoss | 2018 | `public double PressureLoss { get ; set ; }` |